Repository: H-M-Huzaifa/gluco_track
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Your diabetes, in check!
ur: آپ کی ذیابیطس، زیرِ کنٹرول!

source: powered by
ur: منجانب

source: Welcome to GlucoTrack!
ur: گلوکو ٹریک میں خوش آمدید!

# diabetesTrackingApp
source: The diabetes tracking app
ur: ذیابیطس کی نگرانی کی ایپ

source: Get Started
ur: شروع کریں

source: Take Charge of Your Health!
ur: اپنی صحت کا خیال رکھیں!

# checkYourHbA1cInstructions
source: To check your HbA1c, please add your glucose entries for at least 7 days. This will help us provide you with an accurate estimation of your HbA1c levels.
ur: اپنا HbA1c چیک کرنے کے لیے، براہ کرم کم از کم 7 دنوں کے لیے اپنے گلوکوز کی انٹریز شامل کریں۔ اس سے ہمیں آپ کے HbA1c کی سطح کا درست تخمینہ فراہم کرنے میں مدد ملے گی۔

source: Got it!
ur: ٹھیک ھوگیا!

source: Last entry on
ur: آخری انٹری:

source: Not enough data to calculate HbA1c.
ur: HbA1c حساب کرنے کے لیے کافی ڈیٹا نہیں ہے۔

source: No entries yet
ur: کوئی انٹری نہیں

# remainingEntries
source: entries remaining.
ur: انٹریز باقی ہیں۔

# trenddays
source: 7 Days Trend
ur: 7 روزہ سلسلہ

# low
source: Low: Below 5.7%
ur: کم: 5.7% سے نیچے

# normal
source: Normal: 5.8%-6.4%
ur: عمومی: 5.8%-6.4%

# high
source: High: Above 6.4%
ur: زیادہ: 6.4% سے اوپر

source: Glucose
ur: گلوکوز

source: Insulin
ur: انسولین

source: Weekly Glucose Trends
ur: ہفتہ وار گلوکوز کے رجحانات

source: Health Insights
ur: صحت کے راز

source: Generate Health Report
ur: صحت کی رپورٹ بنائیں

# selectTime
source: Select Time Period
ur: دورانیہ منتخب کریں

# infoReportMsg
source: Reports are generated in the background and saved to your downloads folder.
ur: رپورٹس پس منظر میں تیار کی جاتی ہیں اور آپ کے ڈاؤن لوڈ فولڈر میں محفوظ کی جاتی ہیں۔

# enterData
source: Enter Your Data
ur: ڈیٹا کا اندراج

# glucoseLvl
source: 'Glucose Level (mg/dL)'
ur: گلوکوز کی سطح(mg/dl)

# insulinLvl
source: Insulin
ur: انسولین کی سطح(U/ml)

# glucosEntryError
source: Please enter glucose level
ur: براہ کرم گلوکوز کی سطح درج کریں

# insulinEntryError
source: Please enter insulin level
ur: براہ کرم انسولین کی سطح درج کریں

# glucoseLevelWarning
source: Warning: Extreme glucose levels detected!
ur: خبردار: گلوکوز کی خطرناک حدیں معلوم ہوئی ہیں!

# rangeValueError
source: Value must be between {min} and {max}
ur: قدر {min} اور {max} کے درمیان ہونی چاہیے۔

source: Enter
ur: انٹر کریں

# dataSubmit
source: Data submitted successfully!
ur: ڈیٹا کامیابی کے ساتھ جمع ھوگیا!

# todayData
source: You have already submitted data today!
ur: آپ آج پہلے ہی ڈیٹا جمع کر چکے ہیں!

# infoEntry
source: Feel free to enter more than 7 values! The results will be updated based on all your entries.
ur: آپ 7 سے زیادہ ریڈنگز بھی شامل کر سکتے ہیں۔نتائج تمام ریڈنگز کی بنیاد پر اپ ڈیٹ ہوتے رہیں گے۔

# glucoseEntriesTitle
source: Glucose Entries
ur: گلوکوز اندراجات

source: Reset Entries
ur: اندراجات دوبارہ ترتیب دیں

# allEntriesReset
source: All entries have been reset!
ur: تمام اندراجات دوبارہ ترتیب دے دیے گئے ہیں!

# daysColumn
source: Days
ur: دن

# dateTimeColumn
source: Date & Time
ur: تاریخ اور وقت

source: Articles
ur: مضامین

source: Details
ur: تفصیلات

source: Settings
ur: ترتیبات

# langPref
source: Language Prefrences
ur: زبانی ترتیبات

# selectLang
source: Select Language
ur: زبان کا انتخاب

# reminder
source: Reminders
ur: یاد دہانی

source: Glucose Check
ur: گلوکوز چیک

source: Support & Help
ur: مدد اور معاونت

source: FAQ
ur: متواتر پوچھے گئے سوالات

source: Contact Support
ur: ہم سے رابطہ کریں

source: Export
ur: برآمد کریں

# errorTime
source: Please select a time period!
ur: براہِ مہربانی وقت کی مدت کا انتخاب کریں!

# errorEntries
source: No data available for the selected period!
ur: منتخب کردہ مدت کے لئے کوئی ڈیٹا دستیاب نہیں ہے

# errorGenerating
source: Generating report, please wait...
ur: رپورٹ تیار کی جا رہی ہے، براہِ مہربانی انتظار کریں...

# errorFolder
source: Report will be saved to your Downloads folder!
ur: رپورٹ آپ کے ڈاؤن لوڈ فولڈر میں محفوظ ہو جائے گی

# errorFailed
source: Failed to generate report:
ur: رپورٹ تیار نہیں ہو سکی:

source: Last Week
ur: گذشتہ ہفتہ

# twoweek
source: 2 Weeks
ur: دو ہفتوں تک

# month
source: 1 Month
ur: گذشتہ ماہ

source: Till Today
ur: آج تک

# faqWhatIsGlucoTrack
source: What is GlucoTrack?
ur: گلوکو ٹریک کیا ہے؟

# faqWhatIsGlucoTrackAnswer
source: GlucoTrack is a glucose tracking app designed to help diabetic patients monitor their HbA1c levels and daily glucose trends efficiently.
ur: گلوکو ٹریک ایک گلوکوز ٹریکنگ ایپ ہے جو ذیابیطس کے مریضوں کو ان کے HbA1c کی سطح اور روزانہ گلوکوز کے رجحانات کی موثر نگرانی کرنے میں مدد کرنے کے لیے بنائی گئی ہے۔

# faqHowToAddReadings
source: How do I add my glucose readings?
ur: میں اپنی گلوکوز ریڈنگ کیسے شامل کروں؟

# faqHowToAddReadingsAnswer
source: You can add your glucose readings by tapping the '+' button on the home screen. Fill in the required details and save.
ur: آپ ہوم اسکرین پر '+' بٹن کو ٹیپ کرکے اپنی گلوکوز ریڈنگ شامل کرسکتے ہیں۔ مطلوبہ تفصیلات پُر کریں اور محفوظ کریں۔

# faqWhatIsHbA1c
source: What is HbA1c?
ur: HbA1c کیا ہے؟

# faqWhatIsHbA1cAnswer
source: HbA1c (Hemoglobin A1c) is a measure of average blood glucose levels over the past 2-3 months. It is a crucial indicator of long-term glucose control.
ur: HbA1c (Hemoglobin A1c) پچھلے 2-3 مہینوں میں اوسط بلڈ گلوکوز کی سطح کی پیمائش ہے۔ یہ طویل مدتی گلوکوز کنٹرول کا ایک اہم اشارہ ہے۔

# faqOfflineUse
source: Can I use this app offline?
ur: کیا میں یہ ایپ آف لائن استعمال کر سکتا ہوں؟

# faqOfflineUseAnswer
source: Yes, GlucoTrack allows you to store data offline. However, syncing across devices or cloud backup requires an internet connection.
ur: جی ہاں، گلوکو ٹریک آپ کو آف لائن ڈیٹا اسٹور کرنے کی اجازت دیتا ہے۔ تاہم، مختلف آلات میں مطابقت پذیری یا کلاؤڈ بیک اپ کے لیے انٹرنیٹ کنیکشن درکار ہے۔

# faqHbA1cAccuracy
source: How accurate are the HbA1c predictions?
ur: HbA1c کی پیش گوئیاں کتنی درست ہیں؟

# faqHbA1cAccuracyAnswer
source: The HbA1c predictions are based on the data you provide. While itâ€™s a close estimate, consult your doctor for accurate medical advice.
ur: HbA1c کی پیش گوئیاں آپ کے فراہم کردہ ڈیٹا پر مبنی ہیں۔ اگرچہ یہ ایک قریبی تخمینہ ہے، درست طبی مشورے کے لیے اپنے ڈاکٹر سے رجوع کریں۔

# feedbackAndSuggestions
source: Feedback & Suggestions
ur: فیڈ بیک اور تجاویز

# respondWithin24Hours
source: We aim to respond within 24 hours.
ur: ہمارا مقصد 24 گھنٹوں کے اندر جواب دینا ہے۔

# speakToSupportTeam
source: Speak to our support team at +1 234 567 890
ur: ہماری سپورٹ ٹیم سے +1 234 567 890 پر بات کریں۔

source: Call Us
ur: ہمیں کال کریں

# sendUsAnEmail
source: Send us an email at support@glucotrack.com
ur: ہمیں support@glucotrack.com پر ای میل بھیجیں

source: Email Us
ur: ہمیں ای میل کریں

# contactUsForAssistance
source: If you have any questions or need assistance, feel free to reach out to us through one of the options below.
ur: اگر آپ کے کوئی سوالات ہیں یا آپ کو مدد کی ضرورت ہے، تو ذیل میں دیے گئے اختیارات میں سے کسی ایک کے ذریعے ہم سے رابطہ کریں۔

source: We're here to help!
ur: ہم مدد کے لیے حاضر ہیں!

# noGlucoseData
source: No glucose data available. Please add some entries!
ur: کوئی گلوکوز ڈیٹا دستیاب نہیں۔ براہِ کرم کچھ اندراجات شامل کریں۔

source: Happy Weekend!
ur: ہفتہ مبارک!

# riseAndShine
source: Rise & shine! Fresh day!
ur: اٹھو اور چمکو! نیا دن!

# goodMorningSeizeDay
source: Good Morning! Seize the day!
ur: صبح بخیر! دن سے فائدہ اٹھائیں!

# topOfTheMorning
source: Top o' the morning!
ur: صبح کی بہترین شروعات!

source: Good Afternoon! Keep going!
ur: دوپہر بخیر! لگے رہیں!

source: Hello! How's your day?
ur: ہیلو! آپ کا دن کیسا ہے؟

source: Afternoon vibes!
ur: دوپہر کے مزے!

source: Good Evening! Relax.
ur: شام بخیر! آرام کریں ۔

source: Evening! Productive day?
ur: شام! کامیاب دن رہا؟

# starsAndCharm
source: Stars & charm!
ur: ستارے اور دلکشی!
